---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.CutThrough
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.CutThrough

Creates a cut through a model element around the contour of another intersecting model element. The weld between the two elements is also created.